[
    {
        "sentence": "Hello everyone.",
        "start": 265,
        "end": 266
    },
    {
        "sentence": "This is Lecture 39, 310, and we will continue today our discussion of multirate signal processing.",
        "start": 265,
        "end": 275
    },
    {
        "sentence": "Let me share the screen and remind you.",
        "start": 274,
        "end": 279
    },
    {
        "sentence": "We covered last time on the topic of digital interpolation.",
        "start": 278,
        "end": 284
    },
    {
        "sentence": "Okay, Let's see.",
        "start": 284,
        "end": 301
    },
    {
        "sentence": "So let me make sure I have the chat questions come up.",
        "start": 300,
        "end": 312
    },
    {
        "sentence": "So let me remind you that we.",
        "start": 311,
        "end": 321
    },
    {
        "sentence": "Talk about the operation of digital interpolation, which is, as you can imagine, a common operation that goes well beyond just signal processing.",
        "start": 321,
        "end": 334
    },
    {
        "sentence": "But we talked about approaching that topic from a signal processing point of view.",
        "start": 334,
        "end": 339
    },
    {
        "sentence": "And what's fundamental at the heart of that operation is one of the fundamental multi-rate operations.",
        "start": 338,
        "end": 347
    },
    {
        "sentence": "Particular this operation of upsampling.",
        "start": 346,
        "end": 349
    },
    {
        "sentence": "So I want to elaborate on that a little bit and remind you of what is the most important thing for you to be familiar with.",
        "start": 349,
        "end": 361
    },
    {
        "sentence": "Their knowledge that's important for you to be able to go through the problems related to this topic in discourse.",
        "start": 360,
        "end": 368
    },
    {
        "sentence": "And then go back and describe how by cascading this up sampler with a low-pass filter, we can get an interpolation.",
        "start": 367,
        "end": 379
    },
    {
        "sentence": "I'll then talk about some applications of interpolation beyond what I've alluded to so far.",
        "start": 378,
        "end": 386
    },
    {
        "sentence": "For example, all the zoom-in, zoom-out digital operations on images and video.",
        "start": 385,
        "end": 394
    },
    {
        "sentence": "But I'm going to talk about some specific operations.",
        "start": 393,
        "end": 397
    },
    {
        "sentence": "And then we'll move on to the topic of decimation, which is, you can think of it as the reverse operation.",
        "start": 396,
        "end": 405
    },
    {
        "sentence": "And fun in that operation is the notion of downsampling.",
        "start": 405,
        "end": 411
    },
    {
        "sentence": "So the first thing that I want to draw your attention to, which is important, needs to be able to relate just as we have done all along the input and output across this step, both in time and in frequency.",
        "start": 410,
        "end": 425
    },
    {
        "sentence": "So what is the relationship?",
        "start": 424,
        "end": 427
    },
    {
        "sentence": "In frequency?",
        "start": 427,
        "end": 429
    },
    {
        "sentence": "The frequency when we have the upsampling operation.",
        "start": 428,
        "end": 434
    },
    {
        "sentence": "So if I have, this is a closer look at up sampler.",
        "start": 433,
        "end": 444
    },
    {
        "sentence": "So if I have x of n at the input of the signal, the digital signal, or a sequence that goes into an up sampler by a factor of l.",
        "start": 444,
        "end": 466
    },
    {
        "sentence": "And at the output, we obtain something.",
        "start": 466,
        "end": 471
    },
    {
        "sentence": "Let's call that y of n.",
        "start": 471,
        "end": 473
    },
    {
        "sentence": "The relationship, of course, in the time domain is that you insert L minus one zeros in between samples of x and you obtain y into time domain to frequency domain.",
        "start": 472,
        "end": 486
    },
    {
        "sentence": "Y sub d omega is equal to x of the of L times Omega essentially is scaling, are squashing.",
        "start": 486,
        "end": 499
    },
    {
        "sentence": "But the entire frequency axis, omega axis by that, factor out.",
        "start": 498,
        "end": 505
    },
    {
        "sentence": "So let's look at that pictorially and noticed a few important points.",
        "start": 504,
        "end": 511
    },
    {
        "sentence": "Let's see.",
        "start": 510,
        "end": 514
    },
    {
        "sentence": "So right here is the operation that we're talking about.",
        "start": 514,
        "end": 523
    },
    {
        "sentence": "So if the input X sub d in the frequency domain, the DTFT of the input as this given four.",
        "start": 523,
        "end": 532
    },
    {
        "sentence": "Notice what happens, or let's say a factor of three.",
        "start": 532,
        "end": 540
    },
    {
        "sentence": "So in this example, let me just move this with me.",
        "start": 539,
        "end": 546
    },
    {
        "sentence": "Will this, and show you that this is the example for L equal to 3.",
        "start": 545,
        "end": 552
    },
    {
        "sentence": "What happens is, notice a couple of things.",
        "start": 552,
        "end": 559
    },
    {
        "sentence": "First of all, this axis essentially gets squashed by a factor of three, which means that this point, the first crossing that happened at pi over two, now happens at pi over six.",
        "start": 559,
        "end": 572
    },
    {
        "sentence": "And the replica that was centered at two pi is now centered at two pi over three.",
        "start": 572,
        "end": 580
    },
    {
        "sentence": "Okay?",
        "start": 580,
        "end": 581
    },
    {
        "sentence": "So that's the operation of scaling as captured by this factor.",
        "start": 580,
        "end": 584
    },
    {
        "sentence": "But there's another thing to pay attention to.",
        "start": 584,
        "end": 586
    },
    {
        "sentence": "And that is the fact that the height does not change in this process.",
        "start": 586,
        "end": 591
    },
    {
        "sentence": "Yeah, amplitude does not change.",
        "start": 591,
        "end": 596
    },
    {
        "sentence": "As opposed to, for example, when we did sampling rate, which changed the amplitude by a factor of one over T, the sampling interval.",
        "start": 595,
        "end": 605
    },
    {
        "sentence": "Why does it not change?",
        "start": 604,
        "end": 606
    },
    {
        "sentence": "We're altering something, right?",
        "start": 606,
        "end": 611
    },
    {
        "sentence": "We are, we are taking this processing in this way and obtaining this.",
        "start": 611,
        "end": 616
    },
    {
        "sentence": "Why does the height change in this process?",
        "start": 615,
        "end": 619
    },
    {
        "sentence": "Well, so they're both DTFTs, that means they're both periodic, right?",
        "start": 618,
        "end": 635
    },
    {
        "sentence": "But essentially what happens is a periodic with period two byte, you can see in this figure.",
        "start": 635,
        "end": 642
    },
    {
        "sentence": "And if you continue this all the way to Dubai, and you will see that at a periodic, of course, the period is smaller by that factor in this case, but it's still periodic with period two pi.",
        "start": 641,
        "end": 651
    },
    {
        "sentence": "Let's see.",
        "start": 651,
        "end": 652
    },
    {
        "sentence": "So L doesn't affect Amplitude?",
        "start": 652,
        "end": 656
    },
    {
        "sentence": "Yes.",
        "start": 655,
        "end": 656
    },
    {
        "sentence": "Agreed.",
        "start": 656,
        "end": 657
    },
    {
        "sentence": "In the same period.",
        "start": 657,
        "end": 659
    },
    {
        "sentence": "Okay.",
        "start": 658,
        "end": 660
    },
    {
        "sentence": "Are you good?",
        "start": 659,
        "end": 661
    },
    {
        "sentence": "Okay.",
        "start": 661,
        "end": 661
    },
    {
        "sentence": "The last comment, the total energy is the same.",
        "start": 661,
        "end": 664
    },
    {
        "sentence": "So height doesn't need to change.",
        "start": 664,
        "end": 667
    },
    {
        "sentence": "That's exactly right.",
        "start": 666,
        "end": 668
    },
    {
        "sentence": "The total energy is the same, meaning that all we have done to go from here to here is insert zeros in between.",
        "start": 668,
        "end": 674
    },
    {
        "sentence": "We have not changed the total energy.",
        "start": 674,
        "end": 677
    },
    {
        "sentence": "Okay?",
        "start": 676,
        "end": 678
    },
    {
        "sentence": "We have only inserted zeros, zeros samples.",
        "start": 677,
        "end": 680
    },
    {
        "sentence": "And so that's, that's an important observation.",
        "start": 680,
        "end": 682
    },
    {
        "sentence": "Now how did we use this last time?",
        "start": 681,
        "end": 684
    },
    {
        "sentence": "Let me just briefly remind you.",
        "start": 684,
        "end": 686
    },
    {
        "sentence": "Now, we cascaded this operation of upsampling with a low-pass filter.",
        "start": 685,
        "end": 692
    },
    {
        "sentence": "And the low-pass filter cutoff is Pi over that upsampling factor.",
        "start": 692,
        "end": 698
    },
    {
        "sentence": "What does that do?",
        "start": 697,
        "end": 700
    },
    {
        "sentence": "Well, if this is the spectrum of the original analog signal, and this is the corresponding DTFT after sampling, after we have converted that analog signal to digital.",
        "start": 699,
        "end": 712
    },
    {
        "sentence": "What that essentially sampling denser grid.",
        "start": 712,
        "end": 717
    },
    {
        "sentence": "If we were to sample this instead of T1 and T2, we would just be shrinking the corresponding DTFT, right?",
        "start": 717,
        "end": 727
    },
    {
        "sentence": "Notice what happens in this case.",
        "start": 727,
        "end": 731
    },
    {
        "sentence": "Notice the difference between this picture and the previous one to buy is that two pi, right?",
        "start": 730,
        "end": 736
    },
    {
        "sentence": "So I haven't divided by that new scaling factor.",
        "start": 736,
        "end": 740
    },
    {
        "sentence": "But the 0 crossing at the dancer sampling is b times t2, which is equal to b times T1 over L.",
        "start": 739,
        "end": 748
    },
    {
        "sentence": "And essentially what this means is that given this picture, this is what we want to obtain, of course, with adjusting for this factor for the height.",
        "start": 748,
        "end": 756
    },
    {
        "sentence": "And we can do that by realizing that the effect of this squashing up the omega axis, the frequency axis that I just talked about.",
        "start": 756,
        "end": 768
    },
    {
        "sentence": "What it does is that it essentially mix the original spectrum.",
        "start": 768,
        "end": 775
    },
    {
        "sentence": "They did the DTFT at the lower sampling rate.",
        "start": 775,
        "end": 779
    },
    {
        "sentence": "It changes it to essentially be times 12, which is b times the 1 over L.",
        "start": 778,
        "end": 786
    },
    {
        "sentence": "And but remember, the height still doesn't change.",
        "start": 786,
        "end": 792
    },
    {
        "sentence": "So what we need is also a filter factor gain, right, in our low-pass filter to it.",
        "start": 792,
        "end": 797
    },
    {
        "sentence": "Because what we want is we want to find this has to be T2, but the upsampling doesn't change the height.",
        "start": 797,
        "end": 805
    },
    {
        "sentence": "So we will have a low-pass filter with a gain of T1 over T2, so that it converts this quantity into that essentially filters out all the other factors.",
        "start": 805,
        "end": 817
    },
    {
        "sentence": "And the game will make this 1 over T2, which will give us essentially this desire higher sample process.",
        "start": 817,
        "end": 827
    },
    {
        "sentence": "So the digital interpolation is based on this idea.",
        "start": 826,
        "end": 831
    },
    {
        "sentence": "And intuitively the way you can think of it is that by inserting zeros in between two samples, we have created these high-frequency components that need to be smooth it out.",
        "start": 830,
        "end": 842
    },
    {
        "sentence": "And that's the effect of a low-pass filter.",
        "start": 841,
        "end": 843
    },
    {
        "sentence": "And it just makes the new signal smoother in, in the sense that it puts in values in between so that the difference between consecutive samples, the difference between each consecutive, consecutive sample as smaller amplitude.",
        "start": 843,
        "end": 862
    },
    {
        "sentence": "There are differences, so essentially becomes smoother transitions.",
        "start": 862,
        "end": 866
    },
    {
        "sentence": "And pictorially you can, we can visualize that.",
        "start": 865,
        "end": 869
    },
    {
        "sentence": "In fact, that's the next thing I want to talk about, which is one of the applications of this digital interpolation.",
        "start": 869,
        "end": 878
    },
    {
        "sentence": "So let's look at an application that has to do with the, the idea that's used frequently, for example, in commercial audio or music.",
        "start": 877,
        "end": 894
    },
    {
        "sentence": "It has been around for a while.",
        "start": 893,
        "end": 896
    },
    {
        "sentence": "You might have heard it essentially on these advertising for it.",
        "start": 895,
        "end": 900
    },
    {
        "sentence": "The biases that play digital music.",
        "start": 900,
        "end": 904
    },
    {
        "sentence": "And that is the following.",
        "start": 904,
        "end": 907
    },
    {
        "sentence": "So the, the scenario corresponding to that is the follow.",
        "start": 906,
        "end": 910
    },
    {
        "sentence": "It has to do and it's referred to as oversampling, a, oversampling D to a oversampling detuning.",
        "start": 910,
        "end": 922
    },
    {
        "sentence": "So let me write it out and then explain it to.",
        "start": 921,
        "end": 925
    },
    {
        "sentence": "This is the idea is over sampling D to a.",
        "start": 924,
        "end": 934
    },
    {
        "sentence": "And this is one application.",
        "start": 934,
        "end": 936
    },
    {
        "sentence": "One example application of digital interpolation.",
        "start": 936,
        "end": 943
    },
    {
        "sentence": "So how does that example work?",
        "start": 942,
        "end": 944
    },
    {
        "sentence": "Remember, I'm going to remind you of some things we saw earlier in the semester.",
        "start": 944,
        "end": 949
    },
    {
        "sentence": "So the first is that remember when we have a, this is at the output of the digital filter in the middle of the overall processing right?",
        "start": 949,
        "end": 958
    },
    {
        "sentence": "After we have done a to D, we have done our digital filter, which is a topic we just studied.",
        "start": 958,
        "end": 964
    },
    {
        "sentence": "How could design that digital filter.",
        "start": 964,
        "end": 966
    },
    {
        "sentence": "We want to convert that back into an analog signal.",
        "start": 965,
        "end": 969
    },
    {
        "sentence": "And the way we did that was based on taking y of n and for example, creating a 0 order hold, which is essentially take this point and keep it at that level.",
        "start": 969,
        "end": 980
    },
    {
        "sentence": "And then at the next one they can keep it at that level.",
        "start": 980,
        "end": 982
    },
    {
        "sentence": "And then the next level, essentially converting this to this picture and analog signal into a digital signal into an analog signal, which is a step staircase function.",
        "start": 982,
        "end": 993
    },
    {
        "sentence": "And the idea behind that is that we have.",
        "start": 992,
        "end": 995
    },
    {
        "sentence": "Essentially a pulse rate.",
        "start": 995,
        "end": 998
    },
    {
        "sentence": "And we express this as a linear combination of the pulses where the height is the adjusted by the value, by the amplitude of each points.",
        "start": 998,
        "end": 1006
    },
    {
        "sentence": "And then we created this bottom picture.",
        "start": 1006,
        "end": 1009
    },
    {
        "sentence": "Well, remember, there's another step that's involved and you remember that in the frequency domain, doing what we just did, which is essentially this linear, actually the rightmost write about a month ago.",
        "start": 1009,
        "end": 1023
    },
    {
        "sentence": "In the frequency domain, that low-pass filtering to get that center frequency back is equivalent to a that sync perfect sync reconstruction formula that we have, right?",
        "start": 1023,
        "end": 1036
    },
    {
        "sentence": "And what that implies is that essentially we need to have some low-pass filter in the frequency domain, but that low-pass filter eventually has to be operating on an analog signal.",
        "start": 1036,
        "end": 1050
    },
    {
        "sentence": "Okay?",
        "start": 1049,
        "end": 1051
    },
    {
        "sentence": "And that means that it has to be an analog filter.",
        "start": 1050,
        "end": 1054
    },
    {
        "sentence": "It has to be a filter, filter in the sense of filters that you study in EC2 10, not the filters we've been talking about in this class.",
        "start": 1053,
        "end": 1062
    },
    {
        "sentence": "Okay?",
        "start": 1062,
        "end": 1064
    },
    {
        "sentence": "Essentially with analog electronic components.",
        "start": 1063,
        "end": 1067
    },
    {
        "sentence": "Because eventually you're going to take this, then you're going to smooth it out by low-pass filter and generate something.",
        "start": 1067,
        "end": 1074
    },
    {
        "sentence": "And this is, for example, the way would take a digital recording when a digital device, right?",
        "start": 1074,
        "end": 1081
    },
    {
        "sentence": "Audio, video doesn't matter.",
        "start": 1081,
        "end": 1086
    },
    {
        "sentence": "It's a digital device.",
        "start": 1086,
        "end": 1088
    },
    {
        "sentence": "Then you, for sound, you have it, you send that to a transducer and a speaker and then essentially play that analog, regenerate the analog acoustic pressure than then we hear in the form of the music.",
        "start": 1087,
        "end": 1101
    },
    {
        "sentence": "And so this is what gets generated and play right?",
        "start": 1100,
        "end": 1104
    },
    {
        "sentence": "Now.",
        "start": 1104,
        "end": 1105
    },
    {
        "sentence": "Here's the idea.",
        "start": 1105,
        "end": 1106
    },
    {
        "sentence": "And this is at the heart of the idea behind oversampling.",
        "start": 1105,
        "end": 1109
    },
    {
        "sentence": "Need to write this analog filter just like all filters, has some non ideal performance, right?",
        "start": 1109,
        "end": 1120
    },
    {
        "sentence": "Meaning that it is a filter that will have some transition bandwidth, of course, some ripples in the pass band, but most importantly, it has a transition bandwidth.",
        "start": 1120,
        "end": 1130
    },
    {
        "sentence": "And the idea behind oversampling D to a is described in the picture below.",
        "start": 1130,
        "end": 1138
    },
    {
        "sentence": "In this picture, the idea is the following.",
        "start": 1137,
        "end": 1140
    },
    {
        "sentence": "Them describe it to you intuitively without deriving it.",
        "start": 1139,
        "end": 1143
    },
    {
        "sentence": "So instead of doing 0 order hold on the original samples, which are sampled at the lower frequency.",
        "start": 1142,
        "end": 1150
    },
    {
        "sentence": "We take this and before passing it to 0.",
        "start": 1150,
        "end": 1154
    },
    {
        "sentence": "And the role, we do a digital interpolation as I just described to you in the last lecture.",
        "start": 1153,
        "end": 1159
    },
    {
        "sentence": "Upsampling by factor l, followed by a low-pass digital filter, Low-pass digital filter, cutoff pi over L.",
        "start": 1159,
        "end": 1167
    },
    {
        "sentence": "And what that does intuitively, let me draw your attention that instead of this stigma, now we have this digital signal, this sequence, essentially an interpolated version of this where we have put 0 samples in between two.",
        "start": 1167,
        "end": 1182
    },
    {
        "sentence": "Now end up with this.",
        "start": 1182,
        "end": 1184
    },
    {
        "sentence": "Okay?",
        "start": 1184,
        "end": 1185
    },
    {
        "sentence": "Now, instead of passing this directly to the 0, will you pass this interpolated version into the 0 order hold?",
        "start": 1185,
        "end": 1194
    },
    {
        "sentence": "And what does that do?",
        "start": 1194,
        "end": 1195
    },
    {
        "sentence": "That now, generating that staircase function, instead of giving us this, and we get something that looks more like this.",
        "start": 1195,
        "end": 1205
    },
    {
        "sentence": "Okay?",
        "start": 1204,
        "end": 1206
    },
    {
        "sentence": "What does that mean?",
        "start": 1206,
        "end": 1208
    },
    {
        "sentence": "That means that now it resembles, this quantity, resembles the ultimate desired analog outputs more closely.",
        "start": 1208,
        "end": 1220
    },
    {
        "sentence": "Just because the steps in each one of that staircase function is smaller because of that interpolation.",
        "start": 1219,
        "end": 1227
    },
    {
        "sentence": "Okay?",
        "start": 1226,
        "end": 1228
    },
    {
        "sentence": "So what is the effect?",
        "start": 1227,
        "end": 1230
    },
    {
        "sentence": "What does this bias, what it buys us is that now imagine if you had to design an analog filter, this one to operate on this versus an analog filter that would operate on this.",
        "start": 1229,
        "end": 1244
    },
    {
        "sentence": "One thing to effect with B, which felt there do you think would have an easier job producing the same output?",
        "start": 1244,
        "end": 1256
    },
    {
        "sentence": "More accurate output signal exactly.",
        "start": 1256,
        "end": 1263
    },
    {
        "sentence": "Because for the same filter order, analog filter order, I mean, for example, the number of storage elements in your analog filter.",
        "start": 1263,
        "end": 1273
    },
    {
        "sentence": "For that same filter order, you will have a wider transition bandwidth.",
        "start": 1272,
        "end": 1280
    },
    {
        "sentence": "And this is shown in the course notes.",
        "start": 1279,
        "end": 1282
    },
    {
        "sentence": "The derivation of that.",
        "start": 1282,
        "end": 1283
    },
    {
        "sentence": "If we had time, we would go over for those of you interested, I urge you to go through it.",
        "start": 1283,
        "end": 1287
    },
    {
        "sentence": "It's not that complicated, but it shows you exactly how much you can expand the transition bandwidth of this filter by having inserted an interpolator before the 0 order book.",
        "start": 1287,
        "end": 1301
    },
    {
        "sentence": "So if you have a wider transition bandwidth, that means that the same filter order, now you can get better results.",
        "start": 1301,
        "end": 1308
    },
    {
        "sentence": "As pointed out.",
        "start": 1308,
        "end": 1310
    },
    {
        "sentence": "The second one will give us more accurate output signal.",
        "start": 1309,
        "end": 1314
    },
    {
        "sentence": "And so it produces essentially something that resembles that are original analog sound, music, images, video that has been recorded.",
        "start": 1313,
        "end": 1325
    },
    {
        "sentence": "That's the idea.",
        "start": 1324,
        "end": 1325
    },
    {
        "sentence": "And so for a long time, you know, when digital.",
        "start": 1325,
        "end": 1330
    },
    {
        "sentence": "You became popular several decades ago.",
        "start": 1329,
        "end": 1333
    },
    {
        "sentence": "There were a lot of advertisement you would see on devices that 4 times, 2 times oversampling, or four times oversampling, eight times over sampling.",
        "start": 1333,
        "end": 1344
    },
    {
        "sentence": "And after awhile, I think it became obvious that the amount of benefit that you get from a better analog filter is not noticeable to human ears, human audio.",
        "start": 1343,
        "end": 1357
    },
    {
        "sentence": "And so that whole ray stopped at some point, but the idea behind it is exactly where they just suspected.",
        "start": 1357,
        "end": 1362
    },
    {
        "sentence": "Okay.",
        "start": 1362,
        "end": 1364
    },
    {
        "sentence": "All right, so there's another application.",
        "start": 1363,
        "end": 1370
    },
    {
        "sentence": "I mean, of course there are kinds of applications, but another one that is perhaps of direct relevance to ECE students and bio-engineering students is that a lot of these imaging devices, technologies such as for example, CAT scans, MRI, all of these work based on a principle known as tomography, computed tomography.",
        "start": 1369,
        "end": 1392
    },
    {
        "sentence": "And that means that you take projections regardless of whether it's an X-ray signal for CT or what are the different wavelengths that projection gives you samples in a polar representation in the frequency domain of that entity you're interested in imaging, for example, a cross section of an Oregon.",
        "start": 1392,
        "end": 1414
    },
    {
        "sentence": "But ultimately, you need to be able to reconstruct it on a Cartesian coordinate.",
        "start": 1413,
        "end": 1421
    },
    {
        "sentence": "And what that means is that you need to be able to, in a digital, digital coordinate system goal from samples on a portal, the polar grid, onto samples on a Cartesian grid, and that requires interpolation.",
        "start": 1421,
        "end": 1435
    },
    {
        "sentence": "That's another example of all of these things that we're talking about being fundamental in many signal processing applications.",
        "start": 1434,
        "end": 1442
    },
    {
        "sentence": "Okay, So that's all I want to say for now about digital interpolation.",
        "start": 1441,
        "end": 1447
    },
    {
        "sentence": "Now we'll move on to the next topic, which is the topic of decimation.",
        "start": 1446,
        "end": 1450
    },
    {
        "sentence": "Are there any questions before we move on to the new topic, which is related to this topic, of course.",
        "start": 1450,
        "end": 1457
    },
    {
        "sentence": "Okay, very good.",
        "start": 1456,
        "end": 1464
    },
    {
        "sentence": "Let's see.",
        "start": 1464,
        "end": 1466
    },
    {
        "sentence": "So let me talk about the next topic which has to do with Down's first.",
        "start": 1466,
        "end": 1475
    },
    {
        "sentence": "This is the topic of decimation.",
        "start": 1475,
        "end": 1477
    },
    {
        "sentence": "And what destination means.",
        "start": 1476,
        "end": 1488
    },
    {
        "sentence": "I'll just write down the structure for you that this summation is the cascade of two operations similar to what we had before.",
        "start": 1488,
        "end": 1496
    },
    {
        "sentence": "It essentially means that operation.",
        "start": 1496,
        "end": 1501
    },
    {
        "sentence": "First we have a low-pass filter.",
        "start": 1500,
        "end": 1504
    },
    {
        "sentence": "This is G sub d of Omega.",
        "start": 1503,
        "end": 1511
    },
    {
        "sentence": "And this is a low-pass filter with cutoff frequency.",
        "start": 1510,
        "end": 1518
    },
    {
        "sentence": "Omega c equal to pi over D, D being another integer, the decimation back to integer.",
        "start": 1517,
        "end": 1527
    },
    {
        "sentence": "And then this is followed by an operation known as downsampling.",
        "start": 1526,
        "end": 1535
    },
    {
        "sentence": "Downsampling, downsampling by an integer factor D.",
        "start": 1534,
        "end": 1538
    },
    {
        "sentence": "Okay?",
        "start": 1538,
        "end": 1540
    },
    {
        "sentence": "This combination together.",
        "start": 1540,
        "end": 1543
    },
    {
        "sentence": "So essentially this cascade of these two operations is what's known as a decimator estimation.",
        "start": 1542,
        "end": 1552
    },
    {
        "sentence": "So first thing I want to do is I want to do the exact same thing as I did last time for an up sampler.",
        "start": 1551,
        "end": 1559
    },
    {
        "sentence": "Do it for the downsampling.",
        "start": 1558,
        "end": 1561
    },
    {
        "sentence": "In other words, relate the input and output in the time domain and the frequency.",
        "start": 1560,
        "end": 1566
    },
    {
        "sentence": "That's the first step.",
        "start": 1566,
        "end": 1567
    },
    {
        "sentence": "Okay?",
        "start": 1567,
        "end": 1568
    },
    {
        "sentence": "And then we will understand why the role of this low-pass filter is and what the combination of the two enabled us to perform.",
        "start": 1568,
        "end": 1576
    },
    {
        "sentence": "So with that, let's go ahead and let me just make some, call this thing.",
        "start": 1576,
        "end": 1585
    },
    {
        "sentence": "Let's call this thing w of n and this x.",
        "start": 1585,
        "end": 1596
    },
    {
        "sentence": "And relate these two are kept in time and in frequency.",
        "start": 1595,
        "end": 1601
    },
    {
        "sentence": "In time.",
        "start": 1600,
        "end": 1603
    },
    {
        "sentence": "The only thing that this means in time, the only thing that this means is that we take exactly, we do the opposite of what we did with upsampling.",
        "start": 1602,
        "end": 1611
    },
    {
        "sentence": "We take w of n and we drop the minus 1 samples of the discard it, and then be cheap.",
        "start": 1611,
        "end": 1621
    },
    {
        "sentence": "You preserve that these central, for example, if these two, that means that we take w of n, describe every other sample.",
        "start": 1620,
        "end": 1630
    },
    {
        "sentence": "And x sub n is nothing other than w of n, but just only keeping every other sample.",
        "start": 1630,
        "end": 1636
    },
    {
        "sentence": "That's the operation in the diamond.",
        "start": 1635,
        "end": 1637
    },
    {
        "sentence": "Now, what does that do in the frequency domain?",
        "start": 1637,
        "end": 1641
    },
    {
        "sentence": "In the frequency domain, it's a little bit more involved.",
        "start": 1641,
        "end": 1644
    },
    {
        "sentence": "And so I'm going to take you through the steps of how the spectrum W is related to the spectrum of x.",
        "start": 1643,
        "end": 1654
    },
    {
        "sentence": "In order to do that, let me just first talk about a digression, a step that's needed in the derivation.",
        "start": 1653,
        "end": 1664
    },
    {
        "sentence": "And so here when I want to do is I want to establish that relationship.",
        "start": 1664,
        "end": 1669
    },
    {
        "sentence": "Between X sub d Omega and w sub d Omega.",
        "start": 1669,
        "end": 1687
    },
    {
        "sentence": "And in order to do that, let me go through the following digression or a detour.",
        "start": 1687,
        "end": 1701
    },
    {
        "sentence": "That's just an intermediate step that we will need for the derivation.",
        "start": 1700,
        "end": 1705
    },
    {
        "sentence": "Let me write first the form of a finite sum.",
        "start": 1704,
        "end": 1709
    },
    {
        "sentence": "So I'm going to write 1 over dy, the sum over d terms.",
        "start": 1708,
        "end": 1714
    },
    {
        "sentence": "So the index of time as k goes from 0 to d minus 1, e to the power of j two pi over the times k.",
        "start": 1714,
        "end": 1730
    },
    {
        "sentence": "So k is the index of sum.",
        "start": 1730,
        "end": 1738
    },
    {
        "sentence": "And we can write this to be equal to.",
        "start": 1738,
        "end": 1745
    },
    {
        "sentence": "And this thing here is nothing other than you can think of this as a sum of finite terms as US, for example, S sub n.",
        "start": 1745,
        "end": 1755
    },
    {
        "sentence": "Well, let's consider the two cases.",
        "start": 1755,
        "end": 1759
    },
    {
        "sentence": "The cases are when n is equal to m times d.",
        "start": 1758,
        "end": 1770
    },
    {
        "sentence": "And essentially what this means is that n is a multiple integer, multiple of d, and m is any integer.",
        "start": 1770,
        "end": 1784
    },
    {
        "sentence": "And so for that case, if that's what we have, what does this evaluate to?",
        "start": 1784,
        "end": 1794
    },
    {
        "sentence": "What is the value of the sum in that case?",
        "start": 1794,
        "end": 1798
    },
    {
        "sentence": "In other words, insert where you have n into some Insert and times d.",
        "start": 1798,
        "end": 1807
    },
    {
        "sentence": "So if I put instead of n, I put m times d.",
        "start": 1807,
        "end": 1811
    },
    {
        "sentence": "The two these cancel in the numerator and denominator.",
        "start": 1811,
        "end": 1814
    },
    {
        "sentence": "M is an integer.",
        "start": 1813,
        "end": 1815
    },
    {
        "sentence": "It multiplies k.",
        "start": 1815,
        "end": 1817
    },
    {
        "sentence": "And what that means is that we go to pi times an integer, right?",
        "start": 1817,
        "end": 1824
    },
    {
        "sentence": "That's the value, which is what, what is the value of the exponent if n is an integer multiple of the where does that evaluate to the minus one?",
        "start": 1823,
        "end": 1839
    },
    {
        "sentence": "Well, it starts from 0, so you are almost there.",
        "start": 1838,
        "end": 1844
    },
    {
        "sentence": "So it's essentially, this is going to be one, because what we have is essentially integer multiples.",
        "start": 1843,
        "end": 1851
    },
    {
        "sentence": "It becomes e to the power j two pi some integer, which is one.",
        "start": 1850,
        "end": 1856
    },
    {
        "sentence": "How many of them do we have?",
        "start": 1856,
        "end": 1858
    },
    {
        "sentence": "We have d of them.",
        "start": 1857,
        "end": 1858
    },
    {
        "sentence": "So that this sum up to here evaluates to D.",
        "start": 1858,
        "end": 1862
    },
    {
        "sentence": "But then we divide by the, so this becomes one.",
        "start": 1862,
        "end": 1866
    },
    {
        "sentence": "Okay?",
        "start": 1866,
        "end": 1867
    },
    {
        "sentence": "So this is going to be equal to one.",
        "start": 1867,
        "end": 1870
    },
    {
        "sentence": "Is that obvious?",
        "start": 1870,
        "end": 1870
    },
    {
        "sentence": "So everyone?",
        "start": 1870,
        "end": 1871
    },
    {
        "sentence": "Yes.",
        "start": 1871,
        "end": 1876
    },
    {
        "sentence": "Thank you.",
        "start": 1876,
        "end": 1877
    },
    {
        "sentence": "Okay.",
        "start": 1876,
        "end": 1877
    },
    {
        "sentence": "So what about the next case?",
        "start": 1877,
        "end": 1880
    },
    {
        "sentence": "Next case is when the two are not the same.",
        "start": 1879,
        "end": 1883
    },
    {
        "sentence": "So when n is not an integer multiple of d, this evaluates to one over d, right?",
        "start": 1883,
        "end": 1896
    },
    {
        "sentence": "One over D, one minus e to the power of j two pi over D times, and D one minus e to the power of j two Pi N over D.",
        "start": 1896,
        "end": 1917
    },
    {
        "sentence": "And what does that evaluate to?",
        "start": 1916,
        "end": 1919
    },
    {
        "sentence": "0?",
        "start": 1919,
        "end": 1926
    },
    {
        "sentence": "Exactly.",
        "start": 1925,
        "end": 1926
    },
    {
        "sentence": "So basically this becomes 0 because if it's, you end up with 1 minus 1.",
        "start": 1926,
        "end": 1933
    },
    {
        "sentence": "So this, essentially this evaluates to 0.",
        "start": 1932,
        "end": 1935
    },
    {
        "sentence": "So in other words, this is going to be equal to 0.",
        "start": 1935,
        "end": 1940
    },
    {
        "sentence": "Okay?",
        "start": 1939,
        "end": 1941
    },
    {
        "sentence": "So what does that mean?",
        "start": 1941,
        "end": 1942
    },
    {
        "sentence": "That means that this sum, the way I've written it, this thumb, you can think of it as an indicator of friendship.",
        "start": 1942,
        "end": 1948
    },
    {
        "sentence": "In other words, you have a way of stepping through integer multiples of things where the only time it will be non-zero when one variable is an integer multiple of the other quantity of interest.",
        "start": 1948,
        "end": 1965
    },
    {
        "sentence": "And so let's keep this in mind.",
        "start": 1964,
        "end": 1967
    },
    {
        "sentence": "I'm going to use it.",
        "start": 1967,
        "end": 1968
    },
    {
        "sentence": "And the way I'm going to use it is in the steps involved in the derivation of the frequency domain relationship across the down sampler.",
        "start": 1968,
        "end": 1980
    },
    {
        "sentence": "So now what we want to obtain is X sub d omega, which is equal to the sum over n from negative infinity to infinity.",
        "start": 1980,
        "end": 1997
    },
    {
        "sentence": "X of n.",
        "start": 1996,
        "end": 1999
    },
    {
        "sentence": "E to the power of negative j Omega n.",
        "start": 1999,
        "end": 2003
    },
    {
        "sentence": "Now I'm going to replace this x sub n, its corresponding representation of w.",
        "start": 2003,
        "end": 2011
    },
    {
        "sentence": "I already describe what that relationship is in the time domain.",
        "start": 2011,
        "end": 2016
    },
    {
        "sentence": "The relationship is just simply the fact that the x is obtained by taking W add n times d instead of N sample, n times the, right.",
        "start": 2015,
        "end": 2032
    },
    {
        "sentence": "For example, if these two, the first sample is 0, the second sample is two, the next sample is 4.",
        "start": 2032,
        "end": 2039
    },
    {
        "sentence": "So essentially it's the effect of discarding every other cell.",
        "start": 2038,
        "end": 2042
    },
    {
        "sentence": "And the rest is e to the power of negative j Omega n, which is equal to the sum.",
        "start": 2042,
        "end": 2053
    },
    {
        "sentence": "Now I'm going to change that, do a change of, since I want to be able to write this in terms of a variable that is not in this form.",
        "start": 2053,
        "end": 2067
    },
    {
        "sentence": "I'm going to redo this.",
        "start": 2066,
        "end": 2069
    },
    {
        "sentence": "We're going to write it essentially as a variable.",
        "start": 2068,
        "end": 2074
    },
    {
        "sentence": "Let's call that auxiliary variable n, which goes from negative infinity to infinity, but only evaluate the sum at and from integer multiples of d, right?",
        "start": 2073,
        "end": 2091
    },
    {
        "sentence": "So only for the balance.",
        "start": 2091,
        "end": 2093
    },
    {
        "sentence": "So this is a sum over n.",
        "start": 2092,
        "end": 2094
    },
    {
        "sentence": "M goes from negative infinity to infinity.",
        "start": 2094,
        "end": 2097
    },
    {
        "sentence": "But the sun is over n for all the values of n that are represented that integer multiples of d.",
        "start": 2097,
        "end": 2105
    },
    {
        "sentence": "And the argument then becomes w of n.",
        "start": 2105,
        "end": 2109
    },
    {
        "sentence": "Yeah, because I'm only evaluating it at four ends that are integer multiples.",
        "start": 2109,
        "end": 2116
    },
    {
        "sentence": "And then this becomes e to the power of negative j Omega n over d.",
        "start": 2115,
        "end": 2122
    },
    {
        "sentence": "Because n essentially, remember, so the sum is n, but I'm only picking that are integer multiples.",
        "start": 2122,
        "end": 2132
    },
    {
        "sentence": "In other words, let me just write it explicitly.",
        "start": 2132,
        "end": 2138
    },
    {
        "sentence": "Summing only ends that are multiples of the well, we want next, we want to get rid of next, we want to get rid of this restriction than just that over here.",
        "start": 2137,
        "end": 2171
    },
    {
        "sentence": "And that digression result comes to our help.",
        "start": 2171,
        "end": 2175
    },
    {
        "sentence": "So next we want to get rid of restriction of n equals two.",
        "start": 2175,
        "end": 2188
    },
    {
        "sentence": "And the, I want to simplify this.",
        "start": 2188,
        "end": 2191
    },
    {
        "sentence": "And so what I will do is I will write this sum.",
        "start": 2191,
        "end": 2193
    },
    {
        "sentence": "So this is become, this becomes equal to the sum over n from negative infinity to infinity instead of n being only integer multiples.",
        "start": 2193,
        "end": 2205
    },
    {
        "sentence": "And then I'll write it as w up.",
        "start": 2204,
        "end": 2208
    },
    {
        "sentence": "And and now I'm going to put this term.",
        "start": 2207,
        "end": 2212
    },
    {
        "sentence": "This term is 1 over t times the sum over k from 0 to cap, the minus 1 e to the power j two pi over D K N.",
        "start": 2211,
        "end": 2234
    },
    {
        "sentence": "And remember this quantity here is what we have from the digression, right?",
        "start": 2233,
        "end": 2240
    },
    {
        "sentence": "It's basically what I have over here in the previous derivation.",
        "start": 2240,
        "end": 2244
    },
    {
        "sentence": "And what that means is that I can write it as, explicitly write this as this is equal to 0 unless n is equal to m times d, in which case it is one.",
        "start": 2243,
        "end": 2259
    },
    {
        "sentence": "Therefore, this is just another way of writing.",
        "start": 2259,
        "end": 2263
    },
    {
        "sentence": "Another way of writing this awkward notation around the sun by just inserting this thing inside the sun.",
        "start": 2262,
        "end": 2271
    },
    {
        "sentence": "And this essentially does the same thing.",
        "start": 2271,
        "end": 2273
    },
    {
        "sentence": "He just picks values of n that are integer multiples of d.",
        "start": 2273,
        "end": 2277
    },
    {
        "sentence": "And then the rest is e to the power of negative j Omega n over d.",
        "start": 2277,
        "end": 2288
    },
    {
        "sentence": "Okay?",
        "start": 2287,
        "end": 2291
    },
    {
        "sentence": "So there's only one more step.",
        "start": 2291,
        "end": 2294
    },
    {
        "sentence": "And that is just, let's write this explicitly.",
        "start": 2293,
        "end": 2300
    },
    {
        "sentence": "So this becomes, this is equal to 1 over the sum over k from 0 to d minus one.",
        "start": 2299,
        "end": 2316
    },
    {
        "sentence": "And then what is the, the quantity that I have?",
        "start": 2315,
        "end": 2326
    },
    {
        "sentence": "Which is now what I'm doing essentially is that I'm changing the order of the sum.",
        "start": 2326,
        "end": 2337
    },
    {
        "sentence": "So this goes outside and I'm keeping all of that.",
        "start": 2337,
        "end": 2341
    },
    {
        "sentence": "So this sum is over n, This sum is over k, Okay?",
        "start": 2341,
        "end": 2344
    },
    {
        "sentence": "So I'm changing the order.",
        "start": 2344,
        "end": 2346
    },
    {
        "sentence": "So this becomes that first summation.",
        "start": 2346,
        "end": 2348
    },
    {
        "sentence": "And then the next summation is over n from negative infinity to infinity.",
        "start": 2348,
        "end": 2355
    },
    {
        "sentence": "And keeping all the terms now the function of n in front of it.",
        "start": 2354,
        "end": 2359
    },
    {
        "sentence": "So this becomes w up n times e to the power of negative j.",
        "start": 2359,
        "end": 2365
    },
    {
        "sentence": "And then I'm combining the terms which are omega minus two pi k over d.",
        "start": 2365,
        "end": 2375
    },
    {
        "sentence": "Okay?",
        "start": 2375,
        "end": 2385
    },
    {
        "sentence": "What is this quantity?",
        "start": 2384,
        "end": 2390
    },
    {
        "sentence": "Isn't the answer to the question?",
        "start": 2390,
        "end": 2408
    },
    {
        "sentence": "Isn't an N missing in the exponent?",
        "start": 2408,
        "end": 2411
    },
    {
        "sentence": "Possibly, yes.",
        "start": 2411,
        "end": 2413
    },
    {
        "sentence": "Thank you.",
        "start": 2412,
        "end": 2413
    },
    {
        "sentence": "So there has to be an n right here.",
        "start": 2413,
        "end": 2416
    },
    {
        "sentence": "Let me correct that.",
        "start": 2416,
        "end": 2421
    },
    {
        "sentence": "So this is minus Jay.",
        "start": 2420,
        "end": 2424
    },
    {
        "sentence": "And thank you.",
        "start": 2423,
        "end": 2425
    },
    {
        "sentence": "Okay, So what is that quantity now?",
        "start": 2425,
        "end": 2429
    },
    {
        "sentence": "Phase shifted DTFT of w exactly.",
        "start": 2429,
        "end": 2434
    },
    {
        "sentence": "So this is equal to, so this is equal to W sub d of omega minus two pi k over d is essentially a shifted direction, right?",
        "start": 2434,
        "end": 2451
    },
    {
        "sentence": "Well now we have a relationship.",
        "start": 2450,
        "end": 2454
    },
    {
        "sentence": "So I'm going to summarize it, but they can look at it.",
        "start": 2453,
        "end": 2457
    },
    {
        "sentence": "And essentially what that means is that what do we have?",
        "start": 2457,
        "end": 2460
    },
    {
        "sentence": "We have a summation of the terms.",
        "start": 2460,
        "end": 2463
    },
    {
        "sentence": "And then a DTFT that is essentially shifted versions, right?",
        "start": 2463,
        "end": 2469
    },
    {
        "sentence": "And scale, right?",
        "start": 2469,
        "end": 2471
    },
    {
        "sentence": "There are two things going on.",
        "start": 2470,
        "end": 2471
    },
    {
        "sentence": "One is the shifting by this integer fact that it's right case.",
        "start": 2471,
        "end": 2476
    },
    {
        "sentence": "And how many terms that we have the sum is over k.",
        "start": 2476,
        "end": 2479
    },
    {
        "sentence": "We have D replicas.",
        "start": 2479,
        "end": 2482
    },
    {
        "sentence": "So that means that we have D shifted versions of that, right?",
        "start": 2481,
        "end": 2487
    },
    {
        "sentence": "Each one of them shifted by a factor of two pi times an integer.",
        "start": 2486,
        "end": 2490
    },
    {
        "sentence": "And it's also scale, scaled by that factor D.",
        "start": 2489,
        "end": 2493
    },
    {
        "sentence": "Alright, so let me write it down and then try to visuals.",
        "start": 2493,
        "end": 2497
    },
    {
        "sentence": "So this means that what we have is in terms of the relationship across that down sampler is that the output of the sound down sampler in the frequency domain is equal to one over D.",
        "start": 2497,
        "end": 2514
    },
    {
        "sentence": "The sum of the terms the minus 1 w sub d of omega minus two pi k over d.",
        "start": 2514,
        "end": 2533
    },
    {
        "sentence": "And let's make sure that we, we remember this.",
        "start": 2533,
        "end": 2543
    },
    {
        "sentence": "This is an important relationship.",
        "start": 2542,
        "end": 2545
    },
    {
        "sentence": "Okay?",
        "start": 2544,
        "end": 2549
    },
    {
        "sentence": "So when I say remember this is the just need to understand it, right?",
        "start": 2548,
        "end": 2556
    },
    {
        "sentence": "So let me explain that one more time.",
        "start": 2555,
        "end": 2558
    },
    {
        "sentence": "First of all, that means that when you go across the up sampler from, if this is your input, After downsampling by factor D in the frequency domain, you to take the spectrum of x, that IQ spectrum of text, this spectrum of w, and then what does it do to them?",
        "start": 2557,
        "end": 2576
    },
    {
        "sentence": "It shifts it by integer mod two by two by four by six by that way, okay?",
        "start": 2576,
        "end": 2585
    },
    {
        "sentence": "And ads, the terms.",
        "start": 2584,
        "end": 2590
    },
    {
        "sentence": "And each one of them is scale in the frequency domain by a factor of d at Mrs.",
        "start": 2589,
        "end": 2595
    },
    {
        "sentence": "expand, remember, we had put the up sampler, it multiplied the frequency variable.",
        "start": 2594,
        "end": 2600
    },
    {
        "sentence": "And for the down sampler, it is expanding it by that factor D, okay?",
        "start": 2600,
        "end": 2608
    },
    {
        "sentence": "For example, if d is two, if these two, this expression will be the sum of two terms, right?",
        "start": 2608,
        "end": 2615
    },
    {
        "sentence": "Cable it will go from 0 to one.",
        "start": 2615,
        "end": 2617
    },
    {
        "sentence": "We will add up w, which is the spectrum of x plus a two pi shifted version of that same thing, of course, with this scaling factor.",
        "start": 2617,
        "end": 2630
    },
    {
        "sentence": "So a couple of important observations before we visualize and show how this works.",
        "start": 2630,
        "end": 2636
    },
    {
        "sentence": "First of all, why do you suppose we're getting to remember for the up sampler, it was only one.",
        "start": 2636,
        "end": 2645
    },
    {
        "sentence": "It was the same term.",
        "start": 2645,
        "end": 2647
    },
    {
        "sentence": "But now here we're getting a sum of terms.",
        "start": 2646,
        "end": 2649
    },
    {
        "sentence": "Why do you think we're getting to some terms?",
        "start": 2648,
        "end": 2651
    },
    {
        "sentence": "And the thinking that I urge you to go through is, what is the operation of discarding samples?",
        "start": 2651,
        "end": 2662
    },
    {
        "sentence": "What are we doing?",
        "start": 2662,
        "end": 2663
    },
    {
        "sentence": "And think about the relationship between discarding samples and the operation of sampling, right?",
        "start": 2663,
        "end": 2672
    },
    {
        "sentence": "Okay, x sub b equals to x sub b omega, okay?",
        "start": 2672,
        "end": 2683
    },
    {
        "sentence": "So that is the argument 0.",
        "start": 2682,
        "end": 2688
    },
    {
        "sentence": "Is that what you're referring to?",
        "start": 2687,
        "end": 2690
    },
    {
        "sentence": "I think I'm trying to make sure that they follow.",
        "start": 2689,
        "end": 2692
    },
    {
        "sentence": "The suggested explanation.",
        "start": 2692,
        "end": 2694
    },
    {
        "sentence": "Isn't discarding samples.",
        "start": 2693,
        "end": 2702
    },
    {
        "sentence": "Same thing as sampling in a way precisely.",
        "start": 2701,
        "end": 2704
    },
    {
        "sentence": "So this guiding samples essentially means sampling, except that the quantity we are sampling now, he's not a continuous signal was the case for going from a to D.",
        "start": 2703,
        "end": 2717
    },
    {
        "sentence": "Now, we already have a discrete signal, discrete time signal, we have a sequence, but we're discarding samples, which means that we are sampling it again.",
        "start": 2717,
        "end": 2726
    },
    {
        "sentence": "And whenever you sample something, you end up with these essentially periodic extensions.",
        "start": 2726,
        "end": 2731
    },
    {
        "sentence": "Except that in this case, we end up with a finite number of periodic extensions because the input to that process is not a continuous time signal.",
        "start": 2730,
        "end": 2741
    },
    {
        "sentence": "It's already sampling.",
        "start": 2741,
        "end": 2744
    },
    {
        "sentence": "It's already a sequence sampled signal.",
        "start": 2744,
        "end": 2748
    },
    {
        "sentence": "So what I'm saying is that first, let's make a note.",
        "start": 2747,
        "end": 2753
    },
    {
        "sentence": "Compare this expression with the expression of X sub d omega, which is equal to one over T.",
        "start": 2752,
        "end": 2769
    },
    {
        "sentence": "And from negative infinity to infinity, x sub a of omega minus two pi n over T looks very similar, right?",
        "start": 2768,
        "end": 2784
    },
    {
        "sentence": "The difference being that instead of the integer multiple, we have t, which is the sampling interval.",
        "start": 2783,
        "end": 2789
    },
    {
        "sentence": "The limits, we have infinite replicas in the context of sampling.",
        "start": 2789,
        "end": 2795
    },
    {
        "sentence": "In this case we have finite number.",
        "start": 2794,
        "end": 2798
    },
    {
        "sentence": "But that expression, it looks very simple.",
        "start": 2798,
        "end": 2802
    },
    {
        "sentence": "And that's exactly what's going on.",
        "start": 2801,
        "end": 2803
    },
    {
        "sentence": "So this is similar to what happens in Fourier domain and across Central.",
        "start": 2803,
        "end": 2811
    },
    {
        "sentence": "Okay?",
        "start": 2810,
        "end": 2812
    },
    {
        "sentence": "Now, the next thing to do is to think about how we actually evaluate how we visualize this operation in the frequency domain.",
        "start": 2811,
        "end": 2824
    },
    {
        "sentence": "For that, I'm going to show you some examples.",
        "start": 2824,
        "end": 2827
    },
    {
        "sentence": "So let's see if I have examples here.",
        "start": 2826,
        "end": 2835
    },
    {
        "sentence": "Suppose that what I have here is the original x up the Omega.",
        "start": 2835,
        "end": 2857
    },
    {
        "sentence": "What does that mean?",
        "start": 2857,
        "end": 2858
    },
    {
        "sentence": "So x sub B of omega being the, sounds, this, in this example, let's say d is equal to three.",
        "start": 2858,
        "end": 2872
    },
    {
        "sentence": "So we have downsampling by factor three.",
        "start": 2871,
        "end": 2875
    },
    {
        "sentence": "And we want to write the output across the downsampling.",
        "start": 2875,
        "end": 2881
    },
    {
        "sentence": "So in this case basically I'm saying that x is the input, y is the output.",
        "start": 2881,
        "end": 2885
    },
    {
        "sentence": "And now this is the original thing.",
        "start": 2885,
        "end": 2888
    },
    {
        "sentence": "And now we want to see how to evaluate these terms, right?",
        "start": 2888,
        "end": 2891
    },
    {
        "sentence": "The way you would evaluate the terms is let's look at the second thing in the sequence that we would have.",
        "start": 2891,
        "end": 2897
    },
    {
        "sentence": "The second thing would be this corresponds to k equals 0 term.",
        "start": 2896,
        "end": 2903
    },
    {
        "sentence": "So this is k equals 0 term in the summation that we have, right?",
        "start": 2902,
        "end": 2913
    },
    {
        "sentence": "If you look at the summation, if, if, if you look at this summation, we have three terms, k equals 0, Cable 1, and Cable 2.",
        "start": 2913,
        "end": 2923
    },
    {
        "sentence": "But this example, so we'll add up three terms in here.",
        "start": 2923,
        "end": 2927
    },
    {
        "sentence": "Equals 0 term is when there's no phase shift, k is 0 and we only have Omega over d.",
        "start": 2926,
        "end": 2935
    },
    {
        "sentence": "Omega over D.",
        "start": 2935,
        "end": 2937
    },
    {
        "sentence": "Okay?",
        "start": 2937,
        "end": 2938
    },
    {
        "sentence": "And that's exactly what I'm showing in this picture.",
        "start": 2938,
        "end": 2941
    },
    {
        "sentence": "Which is, if this is, this value is what?",
        "start": 2941,
        "end": 2944
    },
    {
        "sentence": "It's pi over four.",
        "start": 2944,
        "end": 2945
    },
    {
        "sentence": "Okay?",
        "start": 2945,
        "end": 2946
    },
    {
        "sentence": "That's the center frequency.",
        "start": 2946,
        "end": 2948
    },
    {
        "sentence": "And now it becomes, it's expanded by a factor of three.",
        "start": 2948,
        "end": 2953
    },
    {
        "sentence": "So that's 0 crossing is going to be at 3 Pi over 4 instead of pi over four.",
        "start": 2953,
        "end": 2957
    },
    {
        "sentence": "So from here, however, for it, you expand it to three Pi over four.",
        "start": 2957,
        "end": 2964
    },
    {
        "sentence": "If I were to write this explicitly, this corresponds to the term where I have w sub d of omega.",
        "start": 2964,
        "end": 2973
    },
    {
        "sentence": "We're just one term of this sum.",
        "start": 2972,
        "end": 2975
    },
    {
        "sentence": "And d is equal to 3.",
        "start": 2974,
        "end": 2977
    },
    {
        "sentence": "And of course, this scaling factor one over d.",
        "start": 2977,
        "end": 2981
    },
    {
        "sentence": "And that's exactly what brings this one to 1 third, okay, that's one term.",
        "start": 2980,
        "end": 2986
    },
    {
        "sentence": "Now, let's look at the other terms.",
        "start": 2986,
        "end": 2988
    },
    {
        "sentence": "What's the next term?",
        "start": 2988,
        "end": 2989
    },
    {
        "sentence": "The next term is at two pi shifted version of that, right?",
        "start": 2989,
        "end": 3002
    },
    {
        "sentence": "So this corresponds now to k equal 1 term.",
        "start": 3002,
        "end": 3006
    },
    {
        "sentence": "What do I mean by that?",
        "start": 3005,
        "end": 3012
    },
    {
        "sentence": "If you look at the expression, you just take, you just take the W sub the Omega already, as we did in for k equals 0 term.",
        "start": 3012,
        "end": 3023
    },
    {
        "sentence": "And then you just shifted by this amount by two, by k by two pi.",
        "start": 3022,
        "end": 3030
    },
    {
        "sentence": "And that's exactly what goes on here.",
        "start": 3030,
        "end": 3034
    },
    {
        "sentence": "We just take this figure and you shifted, shifted by two by, and you end up with this figure, with this picture.",
        "start": 3033,
        "end": 3039
    },
    {
        "sentence": "So the center of that becomes 2 Pi.",
        "start": 3039,
        "end": 3042
    },
    {
        "sentence": "What was here at six Bibles to eight by what was here at six, negative six y equals to negative 45.",
        "start": 3042,
        "end": 3049
    },
    {
        "sentence": "So everything, the whole thing gets shifted by in this direction by a factor two.",
        "start": 3048,
        "end": 3055
    },
    {
        "sentence": "Wave factor two by one more term, right?",
        "start": 3054,
        "end": 3058
    },
    {
        "sentence": "There are three terms because d is equal to 3.",
        "start": 3058,
        "end": 3060
    },
    {
        "sentence": "And that third term is going to be, let's see.",
        "start": 3060,
        "end": 3066
    },
    {
        "sentence": "Okay, got it already.",
        "start": 3065,
        "end": 3075
    },
    {
        "sentence": "That term is going to be, again, another two pi shifted version of that.",
        "start": 3075,
        "end": 3086
    },
    {
        "sentence": "Same thing, right?",
        "start": 3085,
        "end": 3088
    },
    {
        "sentence": "Should probably, let me write this in a way that they're aligned so that becomes easier to visualize.",
        "start": 3088,
        "end": 3095
    },
    {
        "sentence": "Okay?",
        "start": 3095,
        "end": 3107
    },
    {
        "sentence": "So that's k equals 0 term, this is k equal 1 term.",
        "start": 3106,
        "end": 3112
    },
    {
        "sentence": "And this is k equal to 2 term.",
        "start": 3112,
        "end": 3117
    },
    {
        "sentence": "And that's the last term.",
        "start": 3117,
        "end": 3118
    },
    {
        "sentence": "I'll be done from here, is we have taken this and we have shifted it by two by to obtain this.",
        "start": 3117,
        "end": 3126
    },
    {
        "sentence": "So this isn't just the two pi shifted version of what was that centered at 2 Pi now is centered at 45.",
        "start": 3126,
        "end": 3132
    },
    {
        "sentence": "What was entered at eight by now is centered at ten pi, but centered at minus four by centered at minus 25.",
        "start": 3131,
        "end": 3139
    },
    {
        "sentence": "Okay?",
        "start": 3138,
        "end": 3140
    },
    {
        "sentence": "It's just shifted by two pi.",
        "start": 3139,
        "end": 3141
    },
    {
        "sentence": "And now, if you just look at this sum, all we have to do is we just have to add these three terms because that's what this summation does.",
        "start": 3141,
        "end": 3150
    },
    {
        "sentence": "Add those returns.",
        "start": 3150,
        "end": 3151
    },
    {
        "sentence": "And by adding those three terms, what would you get?",
        "start": 3151,
        "end": 3156
    },
    {
        "sentence": "What do we end up with?",
        "start": 3156,
        "end": 3157
    },
    {
        "sentence": "We end up with the following picture.",
        "start": 3157,
        "end": 3160
    },
    {
        "sentence": "Okay?",
        "start": 3160,
        "end": 3170
    },
    {
        "sentence": "So this is the other awesome.",
        "start": 3169,
        "end": 3173
    },
    {
        "sentence": "In other words, this is the output.",
        "start": 3173,
        "end": 3180
    },
    {
        "sentence": "This is the output of down-sampling.",
        "start": 3180,
        "end": 3187
    },
    {
        "sentence": "All I've done here to obtain this is I've added this with this and with this.",
        "start": 3186,
        "end": 3199
    },
    {
        "sentence": "So what that means is that I am showing it, of course, for the range only up to minus three by 23 by, so the centre corresponding to k equals 0 term is nothing other than just this 11.",
        "start": 3199,
        "end": 3210
    },
    {
        "sentence": "Third and the 0 crossing you, that's 3 Pi over 4.",
        "start": 3210,
        "end": 3216
    },
    {
        "sentence": "The second term corresponds to k equal 1 term.",
        "start": 3215,
        "end": 3221
    },
    {
        "sentence": "It's centered at to buy.",
        "start": 3221,
        "end": 3224
    },
    {
        "sentence": "And of course you can continue this picture because you have this periodic behavior.",
        "start": 3223,
        "end": 3228
    },
    {
        "sentence": "Okay?",
        "start": 3228,
        "end": 3229
    },
    {
        "sentence": "So this should reveal a couple of important observations and then I'll stop.",
        "start": 3228,
        "end": 3235
    },
    {
        "sentence": "And we will see how we would use this for operations that actually allow us to do interesting things with two important observations.",
        "start": 3235,
        "end": 3246
    },
    {
        "sentence": "The first one is, it should reveal the answer to this important question.",
        "start": 3245,
        "end": 3252
    },
    {
        "sentence": "Why, how can this is a DTFT, right?",
        "start": 3251,
        "end": 3255
    },
    {
        "sentence": "And all DTFTs are periodic with period two by how can something that have a finite number of terms in it be periodic?",
        "start": 3255,
        "end": 3264
    },
    {
        "sentence": "That's the first place.",
        "start": 3263,
        "end": 3265
    },
    {
        "sentence": "We know that it has to be because this is the DTFT.",
        "start": 3265,
        "end": 3271
    },
    {
        "sentence": "But we don't have infinite number of terms saw candidate barrier.",
        "start": 3270,
        "end": 3276
    },
    {
        "sentence": "That's the first question that I urge you to think.",
        "start": 3275,
        "end": 3278
    },
    {
        "sentence": "Yes.",
        "start": 3277,
        "end": 3289
    },
    {
        "sentence": "So w The itself, it periodic.",
        "start": 3288,
        "end": 3293
    },
    {
        "sentence": "That's precisely the answer.",
        "start": 3293,
        "end": 3295
    },
    {
        "sentence": "Even though we have a finite number of sons, each term in the sum itself is periodic.",
        "start": 3294,
        "end": 3300
    },
    {
        "sentence": "These three, each one of them are periodic.",
        "start": 3300,
        "end": 3303
    },
    {
        "sentence": "And so when we add them together, we end up with a periodic signal.",
        "start": 3302,
        "end": 3307
    },
    {
        "sentence": "And that's why it's a valid DTFT.",
        "start": 3307,
        "end": 3309
    },
    {
        "sentence": "So that's the first observation.",
        "start": 3309,
        "end": 3310
    },
    {
        "sentence": "The second observation that's important is that we don't really, we didn't need to do what I just did for every problem.",
        "start": 3310,
        "end": 3317
    },
    {
        "sentence": "As long as this expansion by a factor of d, W over d does not put the 0 crossing past pi and create aliasing the entire picture.",
        "start": 3317,
        "end": 3331
    },
    {
        "sentence": "This final picture, I put them up in obtained by simply looking at taking this and moving it by a factor of three.",
        "start": 3330,
        "end": 3340
    },
    {
        "sentence": "23 Pi over four.",
        "start": 3340,
        "end": 3343
    },
    {
        "sentence": "And then just repeating that same pattern, that center frequency would be right here.",
        "start": 3342,
        "end": 3347
    },
    {
        "sentence": "And then you just have the same exact pattern.",
        "start": 3347,
        "end": 3350
    },
    {
        "sentence": "You didn't need to explicitly add up the values of the sampling at this picture.",
        "start": 3350,
        "end": 3354
    },
    {
        "sentence": "Why?",
        "start": 3353,
        "end": 3355
    },
    {
        "sentence": "Because, because I know that I am by a factor of four smaller than the Nyquist rate, okay?",
        "start": 3354,
        "end": 3367
    },
    {
        "sentence": "By a factor of four.",
        "start": 3367,
        "end": 3368
    },
    {
        "sentence": "And I'm expanding things by a factor of three.",
        "start": 3368,
        "end": 3372
    },
    {
        "sentence": "So I'm not violating Nyquist after I do my downsampling.",
        "start": 3372,
        "end": 3376
    },
    {
        "sentence": "So all I do is that this just essentially just gets expanded.",
        "start": 3376,
        "end": 3380
    },
    {
        "sentence": "It goes through here.",
        "start": 3379,
        "end": 3381
    },
    {
        "sentence": "And of course I scale, right, and therefore end up with this picture.",
        "start": 3380,
        "end": 3385
    },
    {
        "sentence": "So I could have drawn this with this intermediate steps that I went through over here, as long as, as long as this after expansion by this factor does not create aliasing.",
        "start": 3385,
        "end": 3396
    },
    {
        "sentence": "But what happens if there's aliasing?",
        "start": 3396,
        "end": 3399
    },
    {
        "sentence": "If there's aliasing, this picture is going to change, right?",
        "start": 3398,
        "end": 3402
    },
    {
        "sentence": "And I'll just stop today with urging you to think about why we have that low-pass filter ahead before we perform the operation of downsample.",
        "start": 3402,
        "end": 3414
    },
    {
        "sentence": "That is precisely for that reason.",
        "start": 3413,
        "end": 3416
    },
    {
        "sentence": "Because if for example, instead of this picture, this, this was cutting off at pi over two.",
        "start": 3416,
        "end": 3424
    },
    {
        "sentence": "We have done the original spectrum and then we did downsampling by factor of three.",
        "start": 3423,
        "end": 3431
    },
    {
        "sentence": "You end up with terms that go pass by.",
        "start": 3431,
        "end": 3434
    },
    {
        "sentence": "And when you add them together, essentially, when you add these points together, you end up with changing this original pitch at frequencies around pi.",
        "start": 3433,
        "end": 3443
    },
    {
        "sentence": "And that's why that low-pass filtering before in this operation where they talked about as the summation, this, the role of this is to make sure that it will prevent aliasing before we go through the operation of down-sampled.",
        "start": 3443,
        "end": 3459
    },
    {
        "sentence": "Okay?",
        "start": 3458,
        "end": 3460
    },
    {
        "sentence": "And let me stop here at this point.",
        "start": 3459,
        "end": 3463
    },
    {
        "sentence": "And I will, what I will do on Monday.",
        "start": 3463,
        "end": 3467
    },
    {
        "sentence": "Essentially use this, use this designation for some useful applications.",
        "start": 3467,
        "end": 3473
    },
    {
        "sentence": "Okay, I'll stop here.",
        "start": 3472,
        "end": 3475
    },
    {
        "sentence": "Have a good weekend, everyone, and I'll stick around for a few minutes if there are any questions.",
        "start": 3475,
        "end": 3480
    },
    {
        "sentence": "Now, by the way, before, maybe I should have said it earlier.",
        "start": 3480,
        "end": 3489
    },
    {
        "sentence": "Anyway, I'll repeat it.",
        "start": 3488,
        "end": 3490
    },
    {
        "sentence": "When London we've been asked to marriage you to buy the Canvas evaluation office to Area 2 if you haven't filled out the course evaluations, which is online now, please go ahead and do that.",
        "start": 3490,
        "end": 3505
    },
    {
        "sentence": "It helps the entire process.",
        "start": 3505,
        "end": 3508
    },
    {
        "sentence": "It helps to campus in the department with your value will be next.",
        "start": 3507,
        "end": 3511
    },
    {
        "sentence": "Okay.",
        "start": 3511,
        "end": 3514
    },
    {
        "sentence": "Are there any questions?",
        "start": 3513,
        "end": 3515
    },
    {
        "sentence": "Okay.",
        "start": 3514,
        "end": 3534
    },
    {
        "sentence": "Very good.",
        "start": 3533,
        "end": 3535
    },
    {
        "sentence": "Have a good weekend, everyone.",
        "start": 3534,
        "end": 3536
    },
    {
        "sentence": "See you on Monday.",
        "start": 3535,
        "end": 3536
    }
]